app/views/book/edit.html.erb

SELECT "publishers".* FROM "publishers"
SELECT "genres".* FROM "genres"
---
      <p>出版社</p>
      <%=collection_select(:publisher_id, :id, Publisher.all, :id, :name, include_blank: true, selected: @book.publisher_id) %><br>
      <p>ジャンル１</p>
      <%=collection_select(:genre_id, :genre1_id, Genre.all, :id, :name, include_blank: true, selected: @book.genre1_id) %><br>
      <p>ジャンル２</p>
      <%=collection_select(:genre_id, :genre2_id, Genre.all, :id, :name, include_blank: true, selected: @book.genre2_id) %><br>
      <p>ジャンル３</p>
      <%=collection_select(:genre_id, :genre3_id, Genre.all, :id, :name, include_blank: true, selected: @book.genre3_id) %><br>

SELECT "summaries".* FROM "summaries" WHERE "summaries"."book_id" = ?  [["book_id", 6]]
---
          </tr>
          <% @summaries = Summary.where(book_id:params[:id])%>