app/views/book/new.html.erb

SELECT "publishers".* FROM "publishers"
---
        <p>出版社</p>
            <%=collection_select(:publisher_id, :id, Publisher.all, :id, :name, include_blank: true) %><br>

SELECT "genres".* FROM "genres"
---
        <p>ジャンル１</p>
            <%=collection_select(:genre_id, :genre1_id, Genre.all, :id, :name, include_blank: true) %><br>

SELECT "genres".* FROM "genres"
---
        <p>ジャンル２</p>
            <%=collection_select(:genre_id, :genre2_id, Genre.all, :id, :name, include_blank: true) %><br>

SELECT "genres".* FROM "genres"
---
        <p>ジャンル３</p>
            <%=collection_select(:genre_id, :genre3_id, Genre.all, :id, :name, include_blank: true) %><br>