app/views/book/top.html.erb

SELECT  "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
              <p><%=book.author %></p>
              <p><%=Publisher.find_by(id: book.publisher_id) %></p>
              <span><%=Genre.find_by(id: book.genre1_id) %></span>
              <span><%=Genre.find_by(id: book.genre2_id) %></span>
              <span><%=Genre.find_by(id: book.genre3_id) %></span>