app/controllers/book_controller.rb

SELECT  "books".* FROM "books" ORDER BY "update_at" DESC LIMIT ?  [["LIMIT", 5]]
---
    def top
        @books = Book.all.order(update_at: :desc).limit(5)

INSERT INTO "books" ("title", "image", "author", "publisher_id", "genre1_id", "impression", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @title = params[:title]
        @image = params[:image]
        @author = params[:author]
        @publisher = params[:publisher_id][:id]
        @genre1 = params[:genre_id][:genre1_id]
        @genre2 = params[:genre_id][:genre2_id]
        @genre3 = params[:genre_id][:genre3_id]
        @impression = params[:impression]

        Book.create(title:@title,
                    image:@image,
                    author:@author,
                    publisher_id:@publisher,
                    genre1_id:@genre1,
                    genre2_id:@genre2,
                    genre3_id:@genre3,
                    impression:@impression)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @book = Book.find_by(id: params[:id])

UPDATE "books" SET "title" = ?, "impression" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "論理トレーニング101題"], ["impression", "大変だったです。よろしく。"], ["updated_at", "2020-09-06 01:55:16.069182"], ["id", 6]]
---
    def update
        @title = params[:title]
        @image = params[:image]
        @author = params[:author]
        @publisher = params[:publisher_id][:id]
        @genre1 = params[:genre_id][:genre1_id]
        @genre2 = params[:genre_id][:genre2_id]
        @genre3 = params[:genre_id][:genre3_id]
        @impression = params[:impression]

        Book.update(title:@title,
            image:@image,
            author:@author,
            publisher_id:@publisher,
            genre1_id:@genre1,
            genre2_id:@genre2,
            genre3_id:@genre3,
            impression:@impression)