app/controllers/genre_controller.rb

  def create
    @name = params[:name]
    Genre.create(name: @name)
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "自己啓発"], ["created_at", "2020-09-05 09:04:39.380499"], ["updated_at", "2020-09-05 09:04:39.380499"]]