app/controllers/publisher_controller.rb

  def create
    @name = params[:name]
    Publisher.create(name: @name)
---
INSERT INTO "publishers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "カンキ出版"], ["created_at", "2020-09-05 09:06:05.365789"], ["updated_at", "2020-09-05 09:06:05.365789"]]