app/controllers/summary_controller.rb

  def edit
    @summaries = Summary.where(book_id: params[:id])
    @book = Book.find_by(id: params[:id])
---
SELECT "summaries".* FROM "summaries" WHERE "summaries"."book_id" = ?  [["book_id", 6]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]